# Folder Item Info Class

Source: https://www.revitapidocs.com/2026/ef79812e-ea11-eda4-9c51-b54df57dc197.htm

---

| Folder Item Info Class |
| --- |

Contains data for each folder item in the organization settings of the project browser including grouping parameter Id path and folder name. Inheritance Hierarchy System Object
Autodesk.Revit.DB FolderItemInfo

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class FolderItemInfo : IDisposable
```

```
Public Class FolderItemInfo
	Implements IDisposable
```

```
public ref class FolderItemInfo : IDisposable
```

```
type FolderItemInfo =
    class
        interface IDisposable
    end
```
The FolderItemInfo type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | **Obsolete.** The folder parameter Id |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The folder name |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FolderItemInfo |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetGroupingParameterIdPath | The parameter Id path used to determine the folder items in the browser. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top Remarks FolderItemInfo is the return value of BrowserOrganization.GetFolderItems(). See Also

#### Reference

Autodesk.Revit.DB Namespace